_Rarzrabotki/Rarus/USO2/InformationRegisters/уатНормыРасходаГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатНормыРасходаГСМ</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛинейнаяНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаЕздку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаЗапуск</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаИзменениеСобственногоВеса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаОперацию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаОтопитель</Name>
					<Comment>Норма на отопитель, кондиционер, климат-контроль</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаПростойСВклДвигателем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаПростойСВклДвигателемЛитры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаПростойСВклДвигателемПроцентомОтБазовой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота6</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота7</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота8</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота9</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота10</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу7</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу8</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу9</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу10</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаТранспортнуюРаботу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаСпециальнаяНаМоточас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СезоннаяНадбавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НадбавкаНаКондиционер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьПростоиДляРасчетаНормыМоточасов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АлгоритмРасчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГСМ</Name>
					<Comment>ГСМ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МодельТС</Name>
					<Comment>Модель ТС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатНоменклатураГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатНоменклатураГСМ</Name>
			<Comment>Доп. сведения для ГСМ</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВестиУчетОстатковТЖ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаГСМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатГруппыГСМ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГСМТалона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛитровыйТалон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоминалТалона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Плотность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/уатГруппыГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>уатГруппыГСМ</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Топливо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Масло</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Талон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрисадкиИТехническиеЖидкости</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатНормыРасходаГСМ/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатРегистрФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка,ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоПросмотрМодели") И Параметры.ТолькоПросмотрМодели Тогда
		Элементы.МодельТС.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	//Элементы.ГСМ.СписокВыбора.Очистить();
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уатНоменклатураГСМ.Номенклатура
	|ИЗ
	|	РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
	|ГДЕ
	|	уатНоменклатураГСМ.ГруппаГСМ = ЗНАЧЕНИЕ(Перечисление.уатГруппыГСМ.Топливо)");
	ВыборкаНом = Запрос.Выполнить().Выбрать();
	Пока ВыборкаНом.Следующий() Цикл
		Элементы.ГСМ.СписокВыбора.Добавить(ВыборкаНом.Номенклатура);
	КонецЦикла;
	
	// Если норма копируется - установим дату текущим числом
	Если Не Параметры.ЗначениеКопирования.Пустой() Тогда 
		Запись.Период = НачалоДня(ТекущаяДата());
	КонецЕсли;
	
	Если Запись.НормаНаПростойСВклДвигателемЛитры <> 0 Тогда
		ВидНормыНаПростой = 2;
	ИначеЕсли Запись.НормаНаПростойСВклДвигателемПроцентомОтБазовой <> 0 Тогда
		ВидНормыНаПростой = 1;
	КонецЕсли;
	
	// чтение хранилища значений из объекта копирования, в объекте его нет при копировании
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		МенЗаписи = РегистрыСведений.уатНормыРасходаГСМ.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенЗаписи, Параметры.ЗначениеКопирования);
		АлгоритмРасчета = Неопределено;
		МенЗаписи.Прочитать();
		Если МенЗаписи.Выбран() Тогда
			АлгоритмРасчета = МенЗаписи.АлгоритмРасчета.Получить();
		КонецЕсли;
	Иначе // чтение структуры формулы расчета
		ОбъектЗапись = РеквизитФормыВЗначение("Запись");
		АлгоритмРасчета = ОбъектЗапись.АлгоритмРасчета.Получить();
	КонецЕсли;
	РасчетПоФормуле = (АлгоритмРасчета <> Неопределено);
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтобразитьФормулуРасчета();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТипЗнч(АлгоритмРасчета) = Тип("Структура") Тогда
		ТекущийОбъект.АлгоритмРасчета = Новый ХранилищеЗначения(АлгоритмРасчета);
	Иначе
		ТекущийОбъект.АлгоритмРасчета = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Запись.МодельТС) Тогда
		Если ТипЗнч(Запись.МодельТС) = Тип("СправочникСсылка.ТранспортныеСредства") Тогда
			ОснТопливоПоМодели = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Запись.МодельТС, "уатМодель"), "ОсновноеТопливо");
			ДопТопливоПоМодели = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Запись.МодельТС, "уатМодель"), "ДополнительноеТопливо");
		Иначе
			ОснТопливоПоМодели = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Запись.МодельТС, "ОсновноеТопливо");
			ДопТопливоПоМодели = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Запись.МодельТС, "ДополнительноеТопливо");
		КонецЕсли;
		
		Если Не (Запись.ГСМ = ОснТопливоПоМодели Или Запись.ГСМ = ДопТопливоПоМодели) Тогда 
			ТекстСообщения = "Указанное топливо не соответствует осн. или доп. топливу, указанному в модели ТС.";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Запись.ГСМ",,Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГСМНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//мсвЗначений = Новый Массив;
	//
	//Если ТипЗнч(Запись.МодельТС) = Тип("СправочникСсылка.уатМоделиТС") Тогда 
	//	мсвЗначений.Добавить(уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Запись.МодельТС, "ОсновноеТопливо"));
	//	мсвЗначений.Добавить(уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Запись.МодельТС, "ДополнительноеТопливо"));
	//Иначе 
	//	МодельТС = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Запись.МодельТС, "уатМодель");
	//	мсвЗначений.Добавить(уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(МодельТС, "ОсновноеТопливо"));
	//	мсвЗначений.Добавить(уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(МодельТС, "ДополнительноеТопливо"));
	//КонецЕсли;
	//
	//ОтборГСМ = Новый Структура("Поле, ВидСравнения, Значение", 
	//							"Номенклатура", 
	//							ВидСравненияКомпоновкиДанных.ВСписке,
	//							мсвЗначений);
	//
	//мсвОтборов = Новый Массив;
	//мсвОтборов.Добавить(ОтборГСМ);
	//
	//ДопПараметры = Новый Структура("НачальноеЗначениеВыбора, ИмяПроцедурыОписаниеОповещения, Отбор, КлючУникальности",
	//	Запись.ГСМ, "ГСМНачалоВыбораПродолжение", мсвОтборов, "ВыборГСМвНормеРасхода");
	
	//уатЗащищенныеФункцииКлиент.ВыбратьГСМ(Неопределено, ЭтаФорма, ДопПараметры);
	
	
	ТекОрганизация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		ПользователиКлиентСервер.ТекущийПользователь(), "ОсновнаяОрганизация");
	ДопПараметры = Новый Структура("ЗначениеГСМДоИзменения, ИмяПроцедурыОписаниеОповещения",
		Запись.ГСМ, "ГСМНачалоВыбораПродолжение");
	уатЗащищенныеФункцииКлиент.СписокГСМдляТС(ТекОрганизация, Запись.МодельТС, ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Топливо"),,, ЭтаФорма, ДопПараметры);
	
КонецПроцедуры

// Подключаемый динамически обработчик выбора топлива с отбором.
&НаКлиенте
Процедура ГСМНачалоВыбораПродолжение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Запись.ГСМ = РезультатЗакрытия;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГСМАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	мсвГруппДляОтбора = Новый Массив;
	мсвГруппДляОтбора.Добавить(ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Топливо"));
	ДопПараметры = Новый Структура("ТС", Запись.МодельТС);
	ДанныеВыбора = уатГСМ.ПолучитьСписокАвтоподбораПоляГСМ(Текст, мсвГруппДляОтбора, ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ГСМОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ПараметрыПолученияДанных.СтрокаПоиска = "";
КонецПроцедуры

&НаКлиенте
Процедура НормаНаПростойСВклДвигателемПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Запись.НормаНаПростойСВклДвигателем) Тогда
		Запись.НормаНаПростойСВклДвигателемПроцентомОтБазовой = 0;
		Запись.НормаНаПростойСВклДвигателемЛитры = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормаНаПростойСВклДвигателемПроцентомОтБазовойПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Запись.НормаНаПростойСВклДвигателемПроцентомОтБазовой) Тогда
		Запись.НормаНаПростойСВклДвигателем = 0;
		Запись.НормаНаПростойСВклДвигателемЛитры = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормаНаПростойСВклДвигателемЛитрыПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Запись.НормаНаПростойСВклДвигателемЛитры) Тогда
		Запись.НормаНаПростойСВклДвигателем = 0;
		Запись.НормаНаПростойСВклДвигателемПроцентомОтБазовой = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МодельТСПриИзменении(Элемент)
	УстановитьВидимостьДоступностьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидНормыНаПростойПриИзменении(Элемент)
	Запись.НормаНаПростойСВклДвигателем = 0;
	Запись.НормаНаПростойСВклДвигателемЛитры = 0;
	Запись.НормаНаПростойСВклДвигателемПроцентомОтБазовой = 0;
	УстановитьВидимостьДоступностьНаСервере();	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СпециальнаяРабота1ПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальнаяРабота2ПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальнаяРабота3ПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальнаяРабота4ПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальнаяРабота5ПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальнаяРабота6ПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальнаяРабота7ПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальнаяРабота8ПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальнаяРабота9ПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальнаяРабота10ПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетПоФормулеПриИзменении(Элемент)
	Если НЕ РасчетПоФормуле Тогда
		АлгоритмРасчета = Неопределено;
	КонецЕсли;
	
	ОтобразитьФормулуРасчета();
	УстановитьВидимостьДоступностьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьФормулуНажатие(Элемент)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МодельТС", Запись.МодельТС);
	ПараметрыФормы.Вставить("АлгоритмРасчета", АлгоритмРасчета);
	ОповещениеЗакрытие = Новый ОписаниеОповещения("РедактироватьФормулуЗакрытиеФормы", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.уатНормыРасходаГСМ.Форма.КонструкторФормул", ПараметрыФормы, ЭтаФорма,,,, ОповещениеЗакрытие, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьФормулуЗакрытиеФормы(Результат, ДопПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		АлгоритмРасчета = Результат;
		ОтобразитьФормулуРасчета();
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьДоступностьНаСервере()
	
	Если ТипЗнч(Запись.МодельТС) = Тип("СправочникСсылка.уатМоделиТС") Тогда
		НаличиеСпидометра = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Запись.МодельТС, "НаличиеСпидометра");
	ИначеЕсли ТипЗнч(Запись.МодельТС) = Тип("СправочникСсылка.ТранспортныеСредства") Тогда
		НаличиеСпидометра = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Запись.МодельТС, "уатМодель"), "НаличиеСпидометра");
	Иначе
		НаличиеСпидометра = Истина;
	КонецЕсли;
	
	Элементы.ГруппаЛинейнаяНорма.Видимость = НаличиеСпидометра;
	Элементы.ГруппаНормаНаИзменениеСобственногоВеса.Видимость = НаличиеСпидометра;
	Элементы.ГруппаНормаНаТранспортнуюРаботу.Видимость = НаличиеСпидометра;
	Элементы.ГруппаНормаСпециальнаяНаМоточас.Видимость = НЕ НаличиеСпидометра;
	
	Элементы.ВидНормыНаПростой.СписокВыбора.Очистить();
	Если НаличиеСпидометра Тогда
		Элементы.ВидНормыНаПростой.СписокВыбора.Добавить(0, НСтр("en='km/1 hour of downtime';ru='км/1 час простоя'"));
		Элементы.ВидНормыНаПростой.СписокВыбора.Добавить(1, НСтр("en='% of basic';ru='% от базовой'"));
		Элементы.ВидНормыНаПростой.СписокВыбора.Добавить(2, НСтр("en='l/1 hour of downtime';ru='л/1 час простоя'"));
	Иначе
		Элементы.ВидНормыНаПростой.СписокВыбора.Добавить(0, НСтр("en='l/1 hour of downtime';ru='л/1 час простоя'"));
		Элементы.ВидНормыНаПростой.СписокВыбора.Добавить(1, НСтр("en='% of spec. on moto hour';ru='% от спец. на моточас'"));
		Если ВидНормыНаПростой = 2 Тогда
			ВидНормыНаПростой = 0;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ВидНормыНаПростой = 0 Тогда
		Элементы.ГруппаСтраницыВидПростоя.ТекущаяСтраница = Элементы.ГруппаСтраницаПростойКм;
	ИначеЕсли ВидНормыНаПростой = 1 Тогда
		Элементы.ГруппаСтраницыВидПростоя.ТекущаяСтраница = Элементы.ГруппаСтраницаПростойПроцент;
	ИначеЕсли ВидНормыНаПростой = 2 Тогда
		Элементы.ГруппаСтраницыВидПростоя.ТекущаяСтраница = Элементы.ГруппаСтраницаПростойЛ;
	КонецЕсли;
	
	Для Сч = 1 По 10 Цикл 
		СпецРабота = Запись["СпециальнаяРабота" + Формат(Сч, "ЧГ=0")];
		Элементы["НормаНаСпециальнуюРаботу" + Формат(Сч, "ЧГ=0")].Заголовок = "Норма " + Формат(Сч, "ЧГ=0") + ", л"
		+ ?(ЗначениеЗаполнено(СпецРабота), "/" + ?(СпецРабота.Временный, " ч", " 100 км"), "");
	КонецЦикла;
		
	Элементы.РедактироватьФормулу.Доступность = РасчетПоФормуле;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьФормулуРасчета()
	Если ТипЗнч(АлгоритмРасчета) <> Тип("Структура")
		ИЛИ НЕ АлгоритмРасчета.Свойство("ОбщаяФормула")
		ИЛИ НЕ ЗначениеЗаполнено(АлгоритмРасчета.ОбщаяФормула) Тогда
		Элементы.РедактироватьФормулу.Заголовок = "Формула не указана";
	Иначе
		Элементы.РедактироватьФормулу.Заголовок = АлгоритмРасчета.ОбщаяФормула;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
